# RebarInternalMultiplanarArcConnector Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarInternalMultiplanarArcConnector Property
ParameterTypeId Class See Also
---
"INTERNAL: Multiplanar Arc Connector"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarInternalMultiplanarArcConnector { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarInternalMultiplanarArcConnector As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarInternalMultiplanarArcConnector {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace